'''
此模块放置程序中所有的终端菜单，
包括各种主命令菜单和分级命令菜单
'''
from Server.mysqlpy import Mysqlhelp

#创建客户端访问主命令菜单，提示客户如何执行操作命令
def mainmenu():
    print('********************')
    print('*****注册命令：R*****')
    print('***** 登录命令：L*****')
    print('******退出命令：Q ****')
    print('*********************')
    print('执行命令，请输入命令字母！')


#创建数据库访问显示菜单，提示执行数据库表中的增删改查等功能
#函数的参数为目标数据表table
def visitmenu(tableName):
    sql = 'select * from %s'% tableName
    dbfiles = Mysqlhelp.getall(sql)
    print('+--------+--------+--------+--------------------------+')
    print('|分类编号 |分类名称 |分类详情  |--------参考访问命令--------|')
    print('+--------+--------+--------+--------------------------+')
    x = 1
    for i in dbfiles:
        print('|   %^8d    |    %^8s  |%^8s|' %
              (i[0], i[1], i[2]), '修改：%d  删除：%d  查看：%d' % (x, x, x),)
        print('--------------------------------------------------')
        x += 1
    print('+---------------回车返回主菜单--------------------------+')


#展示产品清单的数据库，执行数据库的查看功能
def searchmenu(tableName):
    sql = 'select * from %s'% tableName 
    dbfiles = Mysqlhelp.getall(sql)
    print('+------+------+--------+------+------+--------------------------+')
    print('|  分类 |产品id| 产品名称|  价格 |产品数量|--------产品详情----------|')
    print('+------+------+--------+------+------+--------------------------+')
    y = 1
    for i in dbfiles:
        print('|%^6s  |%^6d     |%^8s       |%^6s      |%^6d       |%^26s         |' %
              (i[0], i[1], i[2], i[3], i[4], i[5]))
        print('-----------------------------------------------------------')
        y += 1
    print('+---------------回车返回主菜单--------------------------+')


